### 1.Какая текущая версия macOS?
macOS 26 (Tahoe)
### 2.На основе какой UNIX-подобной системы построена операционная система macOS?
Darwin(открытая система от Apple базированная на BSD и микроядре Mach)
### 3.К какому типу относится ядро macOS? В чем отличия между XNU и Mach?
XNU (X is Not Unix)(гибридное)
Mach — это микроядро, отвечает за базовые функции: управление памятью, передачу сообщений, планирование потоков.
XNU включает в себя Mach, а также компоненты FreeBSD и среду драйверов I/O Kit.
Т. е. Mach сам по себе слишком минималистичен для полноценной ОС, а XNU объединяет плюсы монолитных и микро- ядер
### 4. Какой тип архитектуры у процессоров линейки M1 и выше, производимых Apple?
ARM (64-битную архитектуру ARMv8/v9)
### 5. Что такое виртуализация? Приведите примеры гипервизоров.
Виртуализация — это
технология создания программных (виртуальных) версий физических IT-ресурсов (серверов, сетей, хранилищ) на базе одного реального компьютера. 
Она использует гипервизор для запуска нескольких независимых виртуальных машин (ВМ) с собственными ОС на одном оборудовании. 
Гипервизоры: Parallels Desktop, VMware Fusion, Oracle VirtualBox, UTM (на базе QEMU).
### 6. Что такое «командная оболочка» / «командный интерпретатор»?
Программа, принимающая от пользователя команды в текстовом виде и интерпретирующая их для выполнения в ОС
### 7. Как называется командный интерпретатор и какая его версия в используемой операционной системе?
zsh 5.9
### 8. Для каких задач предназначено приложение Terminal в macOS?
Эмулятор терминала, дающий возможность вводить команды, устанавливать ПО, вводить скрипты и т. п.
### 9. Приведите полный путь к домашней папке пользователя, под которым вы авторизованы в системе. Привести пример команды, позволяющей определить путь к домашнему (текущему) каталогу в консоли.
/home/timojj (в macOS Users/timojj
echo $HOME / pwd(если в домашней директории)
### 10. Какой командой можем вывести содержимое каталога системных конфигурационных файлов?
ls -a /etc
### 11. Приведите синтаксис команды для установки файлового менеджера Midnight Commander из консоли в macOS. Привести три варианта команды установки из консоли приложения Terminal в macOS.
1.brew install mc
2.sudo port install mc (если используется MacPorts)
3.fink install mc (если используется Fink)
### 12. Как можно вывести текст руководства (справочной информации) для какой-нибудь команды в консоли?
man [команда]
### 13. Для каких целей используется команда open?
Команда open используется для открытия файлов, папок и приложений так, как если бы вы дважды щелкнули по ним в файловом менеджере.
### 14. Приведите примеры команд группировки и перенаправления, используемых в командном интерпретаторе zsh.
перенаправление >
группировка &&
конвеер |
### 15. С помощью какой команды, можем изменить командный интерпретатор с zsh на bash?
bash
если по умолчанию, то chsh -s /bin/bash
### 16. В каких случаях выполняется инициализация репозитория? Какой командой?
Для создания git структуры
git init
### 17. Что такое коммит?
снапшот состояния файлов в моменте с уникальным хешем
### 18. Почему перед созданием новой ветки важно создать коммит?
зафиксировать изменения, дабы не вызывать кофликтов при переключении
### 19. В каких состояниях может находиться файл в репозитории? Как происходит изменение состояния файла?
1. Untracked (неотслеживаемый) — новый файл.
2. Modified (изменен) — файл изменен, но не добавлен в индекс.
3. Staged (индексирован) — команда git add подготовила файл к коммиту.
4. Committed (зафиксирован) — данные сохранены в базе Git.
### 20. Что такое ветка?
указатель на один из коммитов, представляющий независимую линию разработки
### 21. Какое условие является обязательным для формирования ветки master после клонирования репозитория или его инициализации?
первый коммит
### 22. Что такое HEAD?
указатель на активную ветку/коммит
### 23. Способы создания веток.
git branch <name> — создание
git checkout -b <name> — создать и переход
git switch -c <name> — создание и переход
### 24. Как узнать текущую ветку?
git branch / git status
### 25. Как переключаться между ветками?
git checkout <name> / git switch <name>
### 26. С помощью какой команды можно слить две ветки?
git merge <название_ветки>
### 27. Как подключить к инициализированному (созданному) локальному репозиторию внешний репозиторий? Какой командой?
git remote add origin <URL_репозитория>
### 28. Какая команда позволяет отменить последний коммит?
git reset --soft HEAD~1 (сохраняет изменения)
git reset --hard HEAD~1 (полностью удаляет изменения)
### 29. Для чего предназначена команда rebase?
rebase используется для переноса цепочки коммитов одной ветки на верхушку другой ветки
### 30. В каких случаях требуется создание форка? Приведите способы создания форка, включая консольную команду.
Форкнужен, когда вы хотите изменить чужой проект, но не имеете на это прав
1.кнопка Fork на GitHub/GitLab
2.gh repo fork <владелец>/<репозиторий>
